# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [9]:
baby_names = pd.read_csv('US_Baby_Names_right.csv',sep=',')
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [4]:
list(baby_names.columns.values)

['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count']

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [12]:
baby_names = baby_names.drop(['Unnamed: 0','Id'], axis=1)
baby_names.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK     62
1   Madison  2004      F    AK     48
2    Hannah  2004      F    AK     46
3     Grace  2004      F    AK     44
4     Emily  2004      F    AK     41
5   Abigail  2004      F    AK     37
6    Olivia  2004      F    AK     33
7  Isabella  2004      F    AK     30
8    Alyssa  2004      F    AK     29
9    Sophia  2004      F    AK     28

### Step 6. Is there more male or female names in the dataset?

In [14]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [26]:
names = baby_names.groupby('Name')['Count'].sum()
names

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [27]:
names.shape[0]

17632

### Step 9. What is the name with most occurrences?

In [33]:
names.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [36]:
names[names == names.min()]

Name
Aadarsh     5
Aadin       5
Aaima       5
Aalaya      5
Aaminah     5
           ..
Zyien       5
Zyire       5
Zykeriah    5
Zykierra    5
Zymari      5
Name: Count, Length: 2578, dtype: int64

### Step 11. What is the median name occurrence?

In [37]:
names[names == names.median()]

Name
Aishani    49
Alara      49
Alysse     49
Ameir      49
Anely      49
           ..
Sriram     49
Trinton    49
Vita       49
Yoni       49
Zuleima    49
Name: Count, Length: 66, dtype: int64

### Step 12. What is the standard deviation of names?

In [38]:
names.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.